<a href="https://colab.research.google.com/github/wcj365/python-stats-dataviz/blob/master/pandas_apply.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
df_list = pd.read_html("https://www.genealogybranches.com/censuscosts.html")
len(df_list)

2

In [3]:
df1 = df_list[0]
df1.head()

             0                 1            2                        3
0  Census Year  Total Population  Census Cost  Average Cost Per Person
1         1790           3929214      $44,377               1.13 cents
2         1800           5308483      $66,109               1.24 cents
3         1810           7239881     $178,445               2.46 cents
4         1820           9633822     $208,526               2.16 cents

In [4]:
df2 = df_list[1]
df2.head()

                                                   0
0  The U.S. population reached 300,000,000 on 17 ...

In [6]:
df1

              0                 1               2                        3
0   Census Year  Total Population     Census Cost  Average Cost Per Person
1          1790           3929214         $44,377               1.13 cents
2          1800           5308483         $66,109               1.24 cents
3          1810           7239881        $178,445               2.46 cents
4          1820           9633822        $208,526               2.16 cents
5          1830          12866020        $378,545               2.94 cents
6          1840          17069458        $833,371               4.88 cents
7          1850          23191876      $1,423,351               6.14 cents
8          1860          31443321      $1,969,377               6.26 cents
9          1870          38558371      $3,421,198               8.87 cents
10         1880          50155783      $5,790,678              11.54 cents
11         1890          62979766     $11,547,127              18.33 cents
12         1900          76303387     $11,854,000              15.54 cents
13         1910          91972266     $15,968,000              17.07 cents
14         1920         105710620     $25,117,000              23.76 cents
15         1930         122775046     $40,156,000              32.71 cents
16         1940         131669275     $67,527,000              51.29 cents
17         1950         151325798     $91,462,000              60.44 cents
18         1960         179323175    $127,934,000              71.34 cents
19         1970         203302031    $247,653,000                    $1.22
20         1980         226542199  $1,078,488,000                    $4.76
21         1990         248718301  $2,492,830,000                   $10.02
22         2000         281421906    $4.5 Billion                   $15.99
23        2010*         308745538     $13 Billion                   $42.11

In [8]:
df1.columns

Int64Index([0, 1, 2, 3], dtype='int64')

In [11]:
first_row = df1.iloc[0]
first_row

0                Census Year
1           Total Population
2                Census Cost
3    Average Cost Per Person
Name: 0, dtype: object

In [13]:
df1.columns = first_row
df1.head()

0  Census Year  Total Population  Census Cost  Average Cost Per Person
0  Census Year  Total Population  Census Cost  Average Cost Per Person
1         1790           3929214      $44,377               1.13 cents
2         1800           5308483      $66,109               1.24 cents
3         1810           7239881     $178,445               2.46 cents
4         1820           9633822     $208,526               2.16 cents

In [17]:
df1.head()

0 Census Year Total Population Census Cost Average Cost Per Person
1        1790          3929214     $44,377              1.13 cents
2        1800          5308483     $66,109              1.24 cents
3        1810          7239881    $178,445              2.46 cents
4        1820          9633822    $208,526              2.16 cents
5        1830         12866020    $378,545              2.94 cents

In [ ]:
df1.drop([0], inplace=True)
# df1 = df1.drop([0])
df1.head()

In [19]:
def cleanse_cost(raw_cost):
    cost = raw_cost.lstrip("$").replace(",","")
    if  raw_cost.find("4.5") != -1:          # if "4.5" in raw_cost:
        cost = "45" + "0" * 8
    elif raw_cost.find("Billion") != -1:     # elif "Billion" in raw_cost: 
        cost = "13" + "0" * 9
    return cost

In [20]:
df1["new cost"] = df1["Census Cost"].apply(cleanse_cost)
df1.head()

0 Census Year Total Population Census Cost Average Cost Per Person new cost
1        1790          3929214     $44,377              1.13 cents    44377
2        1800          5308483     $66,109              1.24 cents    66109
3        1810          7239881    $178,445              2.46 cents   178445
4        1820          9633822    $208,526              2.16 cents   208526
5        1830         12866020    $378,545              2.94 cents   378545

In [21]:
df1

0  Census Year Total Population  ... Average Cost Per Person     new cost
1         1790          3929214  ...              1.13 cents        44377
2         1800          5308483  ...              1.24 cents        66109
3         1810          7239881  ...              2.46 cents       178445
4         1820          9633822  ...              2.16 cents       208526
5         1830         12866020  ...              2.94 cents       378545
6         1840         17069458  ...              4.88 cents       833371
7         1850         23191876  ...              6.14 cents      1423351
8         1860         31443321  ...              6.26 cents      1969377
9         1870         38558371  ...              8.87 cents      3421198
10        1880         50155783  ...             11.54 cents      5790678
11        1890         62979766  ...             18.33 cents     11547127
12        1900         76303387  ...             15.54 cents     11854000
13        1910         91972266  ...             17.07 cents     15968000
14        1920        105710620  ...             23.76 cents     25117000
15        1930        122775046  ...             32.71 cents     40156000
16        1940        131669275  ...             51.29 cents     67527000
17        1950        151325798  ...             60.44 cents     91462000
18        1960        179323175  ...             71.34 cents    127934000
19        1970        203302031  ...                   $1.22    247653000
20        1980        226542199  ...                   $4.76   1078488000
21        1990        248718301  ...                  $10.02   2492830000
22        2000        281421906  ...                  $15.99   4500000000
23       2010*        308745538  ...                  $42.11  13000000000

[23 rows x 5 columns]

In [22]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 23 entries, 1 to 23
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Census Year              23 non-null     object
 1   Total Population         23 non-null     object
 2   Census Cost              23 non-null     object
 3   Average Cost Per Person  23 non-null     object
 4   new cost                 23 non-null     object
dtypes: object(5)
memory usage: 1.7+ KB

In [23]:
df1["new cost"] = df1["new cost"].astype(int)

<bound method DataFrame.info of 0  Census Year Total Population  ... Average Cost Per Person     new cost
1         1790          3929214  ...              1.13 cents        44377
2         1800          5308483  ...              1.24 cents        66109
3         1810          7239881  ...              2.46 cents       178445
4         1820          9633822  ...              2.16 cents       208526
5         1830         12866020  ...              2.94 cents       378545
6         1840         17069458  ...              4.88 cents       833371
7         1850         23191876  ...              6.14 cents      1423351
8         1860         31443321  ...              6.26 cents      1969377
9         1870         38558371  ...              8.87 cents      3421198
10        1880         50155783  ...             11.54 cents      5790678
11        1890         62979766  ...             18.33 cents     11547127
12        1900         76303387  ...             15.54 cents     11854000
13        1910         91972266  ...             17.07 cents     15968000
14        1920        105710620  ...             23.76 cents     25117000
15        1930        122775046  ...             32.71 cents     40156000
16        1940        131669275  ...             51.29 cents     67527000
17        1950        151325798  ...             60.44 cents     91462000
18        1960        179323175  ...             71.34 cents    127934000
19        1970        203302031  ...                   $1.22    247653000
20        1980        226542199  ...                   $4.76   1078488000
21        1990        248718301  ...                  $10.02   2492830000
22        2000        281421906  ...                  $15.99   4500000000
23       2010*        308745538  ...                  $42.11  13000000000

[23 rows x 5 columns]>

In [24]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 23 entries, 1 to 23
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Census Year              23 non-null     object
 1   Total Population         23 non-null     object
 2   Census Cost              23 non-null     object
 3   Average Cost Per Person  23 non-null     object
 4   new cost                 23 non-null     int64
dtypes: int64(1), object(4)
memory usage: 1.7+ KB

In [25]:
df1.describe()

0          new cost
count  2.300000e+01
mean   9.445587e+08
std    2.830037e+09
min    4.437700e+04
25%    1.128361e+06
50%    1.185400e+07
75%    1.096980e+08
max    1.300000e+10